proxy-load-test.yml
config:
  target: '{{ $processEnvironment.PROXY_URL }}' # update your .env file with your proxy url
  phases:
    - name: "load test proxy" 
      duration: 60 # length of test in seconds
      arrivalRate: 100 # users per second; 100 * 60 = 6000 users & ~100k events per minute 
  processor: "./build-mp-events.js"
scenarios:
  - flow:
      - loop:
          - get:
              url: "/lib.min.js"
          - loop:
              - function: "generateDataBatch"
              - post:
                  url: "/track?verbose=1"
                  headers:
                    Content-Type: "application/json"
                  json: "{{ dataBatch }}"
            count: 1 # number of times to sent events in a batch
        count: 1 # number of times to execute the outer loop